platformio/platform-ststm32/misc/svd/STM32C092.svd
        <register>
          <name>EXTI_IMR1</name>
          <displayName>EXTI_IMR1</displayName>
          <description>EXTI CPU wakeup with interrupt mask register 1</description>
          <addressOffset>0x080</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFF80000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IM0</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM1</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM2</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM3</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM4</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM5</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM6</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM7</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM8</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM9</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM10</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM11</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM12</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM13</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM14</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM15</name>
              <description>CPU wakeup with interrupt mask on line x (x = 15 to 0)
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM19</name>
              <description>CPU wakeup with interrupt mask on line 19
Setting/clearing this bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM23</name>
              <description>CPU wakeup with interrupt mask on line 23
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM25</name>
              <description>CPU wakeup with interrupt mask on line 25
Setting/clearing each bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM31</name>
              <description>CPU wakeup with interrupt mask on line 31
Setting/clearing this bit unmasks/masks the CPU wakeup with interrupt, by an event on the corresponding line.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with interrupt masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with interrupt unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
